aaron-bond.better-comments
antfu.i18n-ally
be5invis.toml
ChakrounAnas.turbo-console-log
christian-kohler.path-intellisense
cssho.vscode-svgviewer
cwan.native-ascii-converter
dbaeumer.vscode-eslint
eamodio.gitlens
formulahendry.auto-rename-tag
GitHub.vscode-pull-request-github
GregorBiswanger.json2ts
guitoof.conceptor
idleberg.applescript
iocave.customize-ui
iocave.monkey-patch
jpoissonnier.vscode-styled-components
monokai.theme-monokai-pro-vscode
ms-vscode.js-debug-nightly
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
NathHorrigan.code-svgr
naumovs.color-highlight
nikaspran.ast-query
Orta.vscode-jest
pflannery.vscode-versionlens
quicktype.quicktype
svelte.svelte-vscode
tamasfe.even-better-toml
tomoki1207.vscode-input-sequence
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
WallabyJs.wallaby-vscode
wix.vscode-import-cost
